{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/050618f5-dde4-4d35-b1ea-bf65ffbdba2d')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/050618f5-dde4-4d35-b1ea-bf65ffbdba2d')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2021-10-01-preview",
            "properties": {
        "severity": "Medium",
        "query": "AuditLogs\n| where LoggedByService =~ \"PIM\"\n| where Category =~ \"RoleManagement\"\n| where ActivityDisplayName has \"Disable PIM Alert\"\n| extend IpAddress = case(\n  isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)) and tostring(parse_json(tostring(InitiatedBy.user)).ipAddress) != 'null', tostring(parse_json(tostring(InitiatedBy.user)).ipAddress), \n  isnotempty(tostring(parse_json(tostring(InitiatedBy.app)).ipAddress)) and tostring(parse_json(tostring(InitiatedBy.app)).ipAddress) != 'null', tostring(parse_json(tostring(InitiatedBy.app)).ipAddress),\n  'Not Available')\n| extend InitiatedBy = iff(isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)), \n  tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName), tostring(parse_json(tostring(InitiatedBy.app)).displayName)), UserRoles = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)\n| project InitiatedBy, ActivityDateTime, ActivityDisplayName, IpAddress, AADOperationType, AADTenantId, ResourceId, CorrelationId, Identity\n| extend timestamp = ActivityDateTime, IPCustomEntity = IpAddress, AccountCustomEntity = tolower(InitiatedBy), ResourceCustomEntity = ResourceId",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0,
        "displayName": "[#{customername}#] [UC1] Detect PIM Alert Disabling activity",
        "enabled": true,
        "description": "Privileged Identity Management (PIM) generates alerts when there is suspicious or unsafe activity in Azure Active Directory (Azure AD) organization. \nThis query will help detect attackers attempts to disable in product PIM alerts which are associated with Azure MFA requirements and could indicate activation of privileged access",
        "lastUpdatedDateUTC": "2021-10-19T00:00:00Z",
        "createdDateUTC": "2021-09-30T00:00:00Z",
        "status": "Available",
        "kind": "Scheduled",
        "tactics":["Persistence", "PrivilegeEscalation"],
        "Techniques":["T1548","T1098","T1078", "T0890"]
      },
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": true,
                        "lookbackDuration": "PT1H",
                        "matchingMethod": "Selected",
                        "groupByEntities": [
                        ],
                        "groupByAlertDetails": [
                            "Severity"
                        ],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "Alert From unknows",
                    "alertDescriptionFormat": "Alert Description Format",
                    "alertTacticsColumnName": "Adder",
                    "alertSeverityColumnName": null
                },
                "customDetails": {
                    "test": "RawDetails"
                },
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "AccountCustomEntity"
                            }
                        ]
                    },
                    {
                        "entityType": "IP",
                        "fieldMappings": [
                            {
                                "identifier": "Address",
                                "columnName": "IPCustomEntity"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null
            }
        },
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/050618f5-dde4-4d35-b1ea-bf65ffbdba2d/actions/abf00fb4c5b04a2e871c3efb8a594827')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/050618f5-dde4-4d35-b1ea-bf65ffbdba2d/abf00fb4c5b04a2e871c3efb8a594827')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules/actions",
            "apiVersion": "2021-10-01-preview",
            "properties": {
                "ruleId": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/050618f5-dde4-4d35-b1ea-bf65ffbdba2d')]",
                "triggerUri": "[listCallbackURL(concat('/subscriptions/1c4767b1-2a41-41da-8273-b5ec9fca09df/resourceGroups/nf-rdk-development/providers/Microsoft.Logic/workflows/get-subscriptionowner','/triggers/When_a_response_to_an_Azure_Sentinel_alert_is_triggered'),'2016-06-01').value]",
                "logicAppResourceId": "/subscriptions/1c4767b1-2a41-41da-8273-b5ec9fca09df/resourceGroups/nf-rdk-development/providers/Microsoft.Logic/workflows/get-subscriptionowner",
                "operatesOn": "Alert"
            },
            "dependsOn": [
                "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/050618f5-dde4-4d35-b1ea-bf65ffbdba2d')]"
            ]
        },
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/050618f5-dde4-4d35-b1ea-bf65ffbdba2d/actions/309b13bb12d7452c9d3210ddac8e9210')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/050618f5-dde4-4d35-b1ea-bf65ffbdba2d/309b13bb12d7452c9d3210ddac8e9210')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules/actions",
            "apiVersion": "2021-10-01-preview",
            "properties": {
                "ruleId": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/050618f5-dde4-4d35-b1ea-bf65ffbdba2d')]",
                "triggerUri": "[listCallbackURL(concat('/subscriptions/1c4767b1-2a41-41da-8273-b5ec9fca09df/resourceGroups/nf-rdk-devground/providers/Microsoft.Logic/workflows/Get-GeoFromIpAndTagIncident','/triggers/When_a_response_to_an_Azure_Sentinel_alert_is_triggered'),'2016-06-01').value]",
                "logicAppResourceId": "/subscriptions/1c4767b1-2a41-41da-8273-b5ec9fca09df/resourceGroups/nf-rdk-devground/providers/Microsoft.Logic/workflows/Get-GeoFromIpAndTagIncident",
                "operatesOn": "Alert"
            },
            "dependsOn": [
                "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/050618f5-dde4-4d35-b1ea-bf65ffbdba2d')]"
            ]
        }
    ]
}
